// Задайте строку, содержащую латинские буквы в обоих регистрах. 
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string text = "gdsKGF34!-0";
string result = text.ToLower();
Console.Write(result);