// Напишите программу, которая на ввод принимает число и выдает, является ли число четным.
// Напишите программу, которая на вход принимает число (N), а на выходе показывает все четные числв от 1 до N

int number;
number = Console.Read();
if ((number % 2) == 0)
{
    Console.WriteLine("четное");
}
else
{
    Console.WriteLine("нечетное");
}

  int x = Convert.ToInt32(Console.ReadLine());
        if ((x % 2) == 0)
        {
            Console.WriteLine("chentoe");
        }
        else
        {
            Console.WriteLine("nechentoe");
        }