// Напишите программу, которая на ввод принимает число и выдает, является ли число четным.

int number;
number = Console.Read();
if ((number % 2) == 0)
{
    Console.WriteLine("четное");
}
else
{
    Console.WriteLine("нечетное");
}

  int x = Convert.ToInt32(Console.ReadLine());
        if ((x % 2) == 0)
        {
            Console.WriteLine("chentoe");
        }
        else
        {
            Console.WriteLine("nechentoe");
        }