// Напишите программу, которая на ввод принемает два числа и выдвет какое число большее, а какое меньшее.

int firstNumber = 5;
int secondNumber = 6;

if (firstNumber == secondNumber)
{
       Console.WriteLine("числа равны");
}
else if (firstNumber > secondNumber)
{
    Console.WriteLine("первое число больше");
}
else
{
    Console.WriteLine("второе число больше");
}