// На вход программе подаётся некоторое натуральное число N. 
// Необходимо вывести на экран числа от 1 до этого введённого числа.


int n = 100;
int i = 1;

while (i <= n)
{
    //Console.WriteLine(i);
    Console.Write(i);
    Console.Write(' ');
    i = i + 1;
}
